gap> # test formatting status for stdout
gap> old := PrintFormattingStatus("*stdout*");
true
gap> SetPrintFormattingStatus("*stdout*", false);
gap> PrintFormattingStatus("*stdout*");
false
gap> Display(x -> x);
function ( x )
return x;
end
gap> SetPrintFormattingStatus("*stdout*", true);
gap> PrintFormattingStatus("*stdout*");
true
gap> Display(x -> x);
function ( x )
    return x;
end
gap> SetPrintFormattingStatus("*stdout*", old);;
gap> PrintFormattingStatus("*stdout*");
true
gap> 
gap> # test formatting status for current output
gap> old := PrintFormattingStatus("*current*");
true
gap> SetPrintFormattingStatus("*current*", false);
gap> PrintFormattingStatus("*current*");
false
gap> Display(x -> x);
function ( x )
return x;
end
gap> SetPrintFormattingStatus("*current*", true);
gap> PrintFormattingStatus("*current*");
true
gap> Display(x -> x);
function ( x )
    return x;
end
gap> SetPrintFormattingStatus("*current*", old);;
gap> PrintFormattingStatus("*current*");
true
gap> 
gap> QUIT;
