gap> old := PrintFormattingStatus("*stdout*");
true
gap> SetPrintFormattingStatus("*stdout*", false);
gap> PrintFormattingStatus("*stdout*");
false
gap> Display(x -> x);
function ( x )
return x;
end
gap> SetPrintFormattingStatus("*stdout*", true);
gap> PrintFormattingStatus("*stdout*");
true
gap> Display(x -> x);
function ( x )
    return x;
end
gap> SetPrintFormattingStatus("*stdout*", old);;
gap> PrintFormattingStatus("*stdout*");
true
gap> QUIT;
