gap> # test formatting status for stdout
gap> old := PrintFormattingStatus("*stdout*");
true
gap> SetPrintFormattingStatus("*stdout*", false);
gap> PrintFormattingStatus("*stdout*");
false
gap> Display(x -> x);
function ( x )
return x;
end
gap> SetPrintFormattingStatus("*stdout*", true);
gap> PrintFormattingStatus("*stdout*");
true
gap> Display(x -> x);
function ( x )
    return x;
end
gap> SetPrintFormattingStatus("*stdout*", old);;
gap> PrintFormattingStatus("*stdout*");
true
gap> 
gap> # test formatting status for errout
gap> 1/0; # trigger a break loop
Error, Rational operations: <divisor> must not be zero
not in any function at *stdin*:14
type 'quit;' to quit to outer loop
brk> old := PrintFormattingStatus("*errout*");
true
brk> SetPrintFormattingStatus("*errout*", false);
brk> PrintFormattingStatus("*errout*");
false
brk> Display(x -> x);
function ( x )
return x;
end
brk> SetPrintFormattingStatus("*errout*", true);
brk> PrintFormattingStatus("*errout*");
true
brk> Display(x -> x);
function ( x )
    return x;
end
brk> SetPrintFormattingStatus("*errout*", old);;
brk> PrintFormattingStatus("*errout*");
true
brk> QUIT;
