gap> # test returning a replacement value in response to an error
gap> f:={x}->x;;
gap> f();
Error, Function: number of arguments must be 1 (not 0)
not in any function at *stdin*:4
you can replace the argument list <args> via 'return <args>;'
brk> return [42];
42
gap> f:={}->1;;
gap> f(1);
Error, Function: number of arguments must be 0 (not 1)
not in any function at *stdin*:6
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2);
Error, Function: number of arguments must be 0 (not 2)
not in any function at *stdin*:7
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2,3);
Error, Function: number of arguments must be 0 (not 3)
not in any function at *stdin*:8
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2,3,4);
Error, Function: number of arguments must be 0 (not 4)
not in any function at *stdin*:9
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2,3,4,5);
Error, Function: number of arguments must be 0 (not 5)
not in any function at *stdin*:10
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2,3,4,5,6);
Error, Function: number of arguments must be 0 (not 6)
not in any function at *stdin*:11
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> f(1,2,3,4,5,6,7);
Error, Function: number of arguments must be 0 (not 7)
not in any function at *stdin*:12
you can replace the argument list <args> via 'return <args>;'
brk> return [];
1
gap> QUIT;
