# Reported by B.Sambale on 12/24/22 and 01/19/23 in the forum
gap> G:=Group([(1,2,3,4,5)(6,8,7),
> (9,10,12,17,11,15)(13,19,28,38,50,45)(14,21,26,24,23,
> 16)(18,27,35,46,42,36)(20,30,25,34,44,51)(22,32,41,29,39,47)(31,37,49,55,
>     54,48)(33,43,53,40,52,56), (9,11,16,24)(10,13,14,20)(12,18,21,31)(15,22,
> 23,33)(17,25,26,28)(19,29,30,40)(27,36,37,48)(32,42,43,54)(34,45,38,
>     51)(35,47,49,56)(39,41,52,53)(44,46,50,55),
> (10,14)(13,20)(15,23)(17,26)(22,33)(25,28)(27,37)(36,48)(39,52)(41,53)(44,
>     50)(46,55) ]);;
gap> SetAssertionLevel(0);
gap> IsomorphismGroups(G,G)<>fail;
true
gap> g5:=DirectProduct(SmallGroup(1800,328),CyclicGroup(IsPermGroup,4));;
gap> Size(AutomorphismGroup(g5));
3840
gap> G:=Group((1,2)(3,6,4,7,5)(8,21,33,38,15,20,19,48,37,16)
> (9,25,12,51,30,28,13,31,42,
>         32)(10,29,39,44,24,11,26,41,34,27)(14,36,45,40,17,18,23,46,22,35)(43,
>         54)(47,49)(50,55)(52,53), (1,2)(3,5,7,4,6)(8,40,14,38)(9,55,24,
>         49)(10,32,13,44)(11,30,25,34)(12,21,26,36)(15,54,17,53)(16,43,35,
>         52)(18,37,20,22)(19,29,23,31)(27,47,28,50)(33,51,45,41)(39,48,42,46),
>       (3,6,4,7,5)(8,24,43,10,17,47,14,9,52,13,15,50)(11,16,49,20,28,54,25,35,
>         55,18,27,53)(12,42,34,19,33,22,26,39,30,23,45,37)(21,46,40,31,41,44,
>         36,48,38,29,51,32), (1,2)(3,7,6,5,4)(8,14)(9,33,37,12,47,24,45,22,26,
>         50)(10,13)(15,39,34,19,52,17,42,30,23,43)(16,51,44,36,53)(21,54,35,
>         41,32)(27,48,40,31,55)(28,46,38,29,49));;
gap> H:=Group((1,2)(3,4,5,6,7)(8,45,15,23,37,14,33,17,19,22)
> (9,26,30,10,42,24,12,34,13,
>         39)(11,41,27,29,44)(16,21,38,20,48)(18,46,35,36,40)(25,51,28,31,
>         32)(43,52)(47,50), (8,47)(9,19)(10,52)(11,54)(12,17)(13,43)(14,
>         50)(15,26)(16,31)(18,49)(20,55)(21,27)(23,24)(25,53)(28,36)(29,
>         35)(32,44)(33,45)(38,40)(39,42), (1,2)(3,7,6,5,4)(8,26,30,13,19,22,
>         14,12,34,10,23,37)(9,45,52,17,39,47,24,33,43,15,42,50)(11,36,38,20,
>         29,32,25,21,40,18,31,44)(16,51,55,28,46,53,35,41,49,27,48,54),
>       (3,6,4,7,5)(8,55,15,44,12,18,50,35,34,29,14,49,17,32,26,20,47,16,30,
>         31)(9,38,23,11,52,27,37,21,10,54,24,40,19,25,43,28,22,36,13,53)(33,
>         46,45,48)(39,51,42,41));;
gap> IsomorphismGroups(G,H)<>fail;
true
